# 運算元 運算子 運算元   => 二元運算子
# 1 + 1     -> 2
# '2' + '3' -> '23'


# 算數
# +, -, *, /, //, %, **
# print(2**4)



# 比較 comparison
# == , != (不相等), >, >=, <, <=
1 == 1   # True
'1' == 1 # False


# 邏輯運算子
# and, or


成績 = 80       # 90    ,   80
英文檢定 = False # True  ,   False


成績 > 85           # 條件(1)   -> no(False)
英文檢定 == True    # 條件(2)   -> no(False)

# A 課程: 兩項條件都要符合
# B 課程: 兩項條件符合一項以上就可以


if 成績 > 85 and 英文檢定 == True:
    print("參加A")

if 成績 > 85 or 英文檢定 == True:
    print("參加B")


# 指定運算子
# 左邊的變數空間 = 右邊的值/右邊的運算結果


# 複合指定運算子  +=, -=, /=, //=, %=, **=

s = 1
s += 10      # 簡化版的寫法，意義相等於 s = s + 1
print(s)
# 左 += 右   => 左 = 左 + 右

a = 'h'
a *= 2       # 簡化版的寫法，意義相等於 a = a * 2 重複字串 2 次
print(a)


# 一元運算子
3-5 # (減) 二元運算
-5  # (負) 一元運算，意義上來說是 5*(-1)

not True # 反向邏輯